Model: "seq_maxpool_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 147, 147, 24)      1176      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 73, 73, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 70, 70, 48)        18480     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 35, 35, 48)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 96)        73824     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 96)        0         
_________________________________________________________________
flatten (Flatten)            (None, 24576)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               12583424  
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 513       
=================================================================
Total params: 12,677,417
Trainable params: 12,677,417
Non-trainable params: 0
_________________________________________________________________
