Model: "seq_maxpool_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 148, 148, 256)     7168      
_________________________________________________________________
batch_normalization (BatchNo (None, 148, 148, 256)     1024      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 74, 74, 256)       0         
_________________________________________________________________
dropout (Dropout)            (None, 74, 74, 256)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 36, 36, 256)       590080    
_________________________________________________________________
batch_normalization_1 (Batch (None, 36, 36, 256)       1024      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 18, 18, 256)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 18, 18, 256)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 16, 256)       590080    
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
_________________________________________________________________
dense (Dense)                (None, 128)               2097280   
_________________________________________________________________
batch_normalization_3 (Batch (None, 128)               512       
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258       
=================================================================
Total params: 3,288,450
Trainable params: 3,286,658
Non-trainable params: 1,792
_________________________________________________________________
